/* The string for canceling a map editing function. */
"CancelKey" = "取消";

/* The title text in the alert when cancelling map editing. */
"CancelEditAlertTitleKey" = "是否确定要取消？";

/* The message text in the alert when cancelling map editing (no points created). */
"CancelEditAlertMessageKey" = "不会保存您的更改。";

/* The message text in the alert when cancelling map editing (points created). */
"CancelEditAlertPointsCreatedMessageKey" = "您创建的对象将不会保存。";

/* The text of the alert action when discarding editing changes. */
"DiscardChangesTitleKey" = "放弃更改";

/* The text of the alert action when the users cancels editing an address field */
"CancelEditingTitleKey" = "取消编辑";

/* The title text in the alert when entering an address that is invalid. */
"InvalidAddressTitleKey" = "无效地址";

/* The message in the invalid address alert when an address is required. */
"AddressRequiredMessage" = "必须包括点的地址";

/* The title text in the alert when inputting empty text into a new address cell. */
"NoAddedLocationTitleKey" = "尚未添加此点的位置";

/* The message text in the alert when inputting empty text into a new address cell. */
"NoAddedLocationMessageKey" = "将不会添加新点";

/* The text of the alert action to continuing editing. */
"ContinueEditingTitleKey" = "继续编辑";

/* The title text in the alert when tapping an invalid point when trying to delete. */
"DeletePointErrorTitleKey" = "选择要删除的点。";

/* The title text in the alert when trying to delete an editing point on the map, but no editing points exist. */
"EmptyDeletePointErrorTitleKey" = "没有可删除的点。";

/* The text of the alert action to dismiss the alert. */
"OKTitleKey" = "确定";

/* The title text of the alert when deleting all stored editing points. */
"ClearAllPointsTitleKey" = "是否确定要清除所有点？";

/* The text of the alert action to reject the alert prompt. */
"NoTitleKey" = "否";

/* The text of the alert action to accept the alert prompt */
"YesTitleKey" = "是";

/* The title text of the alert when switching editing geometries to a point. */
"ChangeGeometryPointTitleKey" = "是否要切换到点？";

/* The title text of the alert when switching editing geometries to a polyline. */
"ChangeGeometryPolylineTitleKey" = "是否要切换到折线？";

/* The title text of the alert when switching editing geometries to a polygon. */
"ChangeGeometryPolygonTitleKey" = "是否要切换到多边形？";

/* The message text in the alert when switching to a multipoint geometry. */
"ChangeGeometryToMultiPointMessageKey" = "您添加的点将不会更改，您可以继续创建对象";

/* The message text in the alert when switching to a point geometry. */
"ChangeGeometryToPointMessageKey" = "将删除您添加的所有点";

/* The title text of the alert when deleting a point of the editing geometry. */
"DeletePointTitleKey" = "是否确定要删除此点？";

/* The title of the button to save the editing geometry. */
"SaveButtonTitleKey" = "保存";

/* The title of the button to filter the geometry. */
"FilterTitleKey" = "过滤器";

/* The status text of the User Location TableViewCell in the suggesiton panel. */
"CurrentLocationKey" = "当前位置";

/* The footnote text of the TableViewCell in the suggesiton panel if no suggestions are returned. */
"NoSuggestionsFoundKey" = "未找到建议";

/* The text of the editingPanel Address textField. */
"AddressKey" = "地址";

/* The title of the button to delete all stored editing points. */
"ClearAllKey" = "全部清除";

/* The text of the Toast Message after creating an object. */
"CreatedObjectToastMessage" = "%@ 已成功创建";

/* The placeholder text of the Searchbar */
"SearchKey" = "搜索";

/* The placeholder text to add a new geospatial point by tapping on the map or typing an address. */
"AddNewPointKey" = "添加新点";

/* The title of the cell to pick from available map types. */
"BasemapKey" = "底图";

/* The title for the standard map type. */
"StandardKey" = "标准";

/* The title for the hybrid map type. */
"HybridKey" = "混合";

/* The title for the hybrid flyover map type. */
"HybridFlyoverKey" = "混合俯瞰";

/* The title for the muted standard map type. */
"MutedStandardKey" = "静音标准";

/* The title for the satellite map type. */
"SatelliteKey" = "卫星";

/* The title for the satellite flyover map type. */
"SatelliteFlyoverKey" = "卫星俯瞰";

/* The text of add location button for location form cell. */
"AddLocationButtonKey" = "添加位置";

